unhuman-io/obot-controller/combiner_g474/combiner_g474.ioc
#MicroXplorer Configuration settings - do not modify
Mcu.Family=STM32G4
ProjectManager.MainLocation=Src
RCC.USART1Freq_Value=170000000
RCC.SAI1Freq_Value=170000000
RCC.CortexFreq_Value=170000000
ProjectManager.KeepUserCode=true
Mcu.UserName=STM32G474RETx
PC12.Locked=true
PC12.Signal=GPIO_Output
PA14.GPIO_Label=T_SWCLK
NVIC.RTC_WKUP_IRQn=true\:0\:0\:false\:false\:true\:true\:true
ProjectManager.functionlistsort=1-MX_GPIO_Init-GPIO-false-HAL-true,2-SystemClock_Config-RCC-false-HAL-false,3-MX_HRTIM1_Init-HRTIM1-false-HAL-true,4-MX_USB_PCD_Init-USB-false-HAL-true,5-MX_FDCAN3_Init-FDCAN3-false-HAL-true,6-MX_RTC_Init-RTC-false-HAL-true
NVIC.USB_HP_IRQn=true\:0\:0\:false\:false\:true\:true\:true
VP_RTC_VS_RTC_Activate.Mode=RTC_Enabled
NVIC.FDCAN3_IT0_IRQn=true\:0\:0\:false\:false\:true\:true\:true
PA11.Mode=Device
RCC.RTCFreq_Value=32768
PD2.GPIO_Speed=GPIO_SPEED_FREQ_VERY_HIGH
RCC.USART2Freq_Value=170000000
PD2.Locked=true
VP_RTC_VS_RTC_Calendar.Signal=RTC_VS_RTC_Calendar
PD2.GPIOParameters=GPIO_Speed,GPIO_Label
PB15.Signal=HRTIM1_CHD2
HRTIM1.OCPulse_TD1=hrperiod/2
PinOutPanel.RotationAngle=0
RCC.MCO1PinFreq_Value=16000000
RCC.SYSCLKSource=RCC_SYSCLKSOURCE_PLLCLK
ProjectManager.StackSize=0x4000
HRTIM1.UpDownMode-Output_TF1TF2=HRTIM_TIMERUPDOWNMODE_UPDOWN
RTC.WakeUpClock-WakeUp=RTC_WAKEUPCLOCK_CK_SPRE_16BITS
RCC.I2C3Freq_Value=170000000
RCC.LPTIM1Freq_Value=170000000
Mcu.IP4=RTC
RCC.FCLKCortexFreq_Value=170000000
Mcu.IP5=SYS
Mcu.IP2=NVIC
NVIC.SVCall_IRQn=true\:0\:0\:false\:false\:true\:false\:false
Mcu.IP3=RCC
Mcu.IP0=FDCAN3
Mcu.IP1=HRTIM1
PA12.Signal=USB_DP
Mcu.UserConstants=hrperiod,27200*2;main_loop_period,170e6/10000
Mcu.ThirdPartyNb=0
RCC.HCLKFreq_Value=170000000
RCC.I2C4Freq_Value=170000000
Mcu.IPNb=7
ProjectManager.PreviousToolchain=
RCC.APB2TimFreq_Value=170000000
PC7.Signal=HRTIM1_CHF2
RCC.ADC345CLockSelection=RCC_ADC345CLKSOURCE_PLL
RTC.IPParameters=WakeUpClock-WakeUp,WakeUpCounter-WakeUp
Mcu.Pin6=PC6
Mcu.Pin7=PC7
Mcu.Pin8=PC8
Mcu.Pin9=PC9
HRTIM1.ORingUpdateSource_ADCTrigger5=HRTIM_ADCTRIGGERUPDATE_TIMER_F
RCC.AHBFreq_Value=170000000
RCC.PREFETCH_ENABLE=1
Mcu.Pin0=PC14-OSC32_IN
Mcu.Pin1=PC15-OSC32_OUT
Mcu.Pin2=PF0-OSC_IN
HRTIM1.ORingUpdateSource_ADCTrigger1=HRTIM_ADCTRIGGERUPDATE_TIMER_F
Mcu.Pin3=PF1-OSC_OUT
RCC.USART3Freq_Value=170000000
Mcu.Pin4=PB14
Mcu.Pin5=PB15
ProjectManager.ProjectBuild=false
RCC.HSE_VALUE=24000000
NVIC.UsageFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false
NVIC.DebugMonitor_IRQn=true\:0\:0\:false\:false\:true\:false\:false
PA15.Mode=FDCANFD
NVIC.SysTick_IRQn=true\:0\:0\:false\:false\:true\:false\:true
RCC.ADC12Freq_Value=56666666.666666664
RCC.RTCClockSelection=RCC_RTCCLKSOURCE_LSE
HRTIM1.OCMode_TE1=HRTIM_BASICOCMODE_ACTIVE
ProjectManager.FirmwarePackage=STM32Cube FW_G4 V1.2.0
MxDb.Version=DB.5.0.60
HRTIM1.EnableCalibration=DLLSimpleCalibration
ProjectManager.BackupPrevious=false
PC14-OSC32_IN.Mode=LSE-External-Oscillator
RCC.VCOInputFreq_Value=4000000
PF0-OSC_IN.Locked=true
PB14.Mode=Output_TD1TD2
File.Version=6
PC9.Mode=Output_TE1TE2
VP_SYS_VS_DBSignals.Mode=DisableDeadBatterySignals
HRTIM1.Source_ADCTrigger5=HRTIM_ADCTRIGGEREVENT579_TIMERF_PERIOD
PA8.Signal=FDCAN3_RX
HRTIM1.OCMode_TF1=HRTIM_BASICOCMODE_ACTIVE
RCC.PLLRCLKFreq_Value=170000000
HRTIM1.OCMode_TF2=HRTIM_BASICOCMODE_INACTIVE
NVIC.PendSV_IRQn=true\:0\:0\:false\:false\:true\:false\:false
HRTIM1.OCPolarity_TD1=HRTIM_OUTPUTPOLARITY_HIGH
ProjectManager.HalAssertFull=false
RCC.CRSFreq_Value=48000000
ProjectManager.ProjectName=combiner_g474
PA13.GPIOParameters=GPIO_Label
PB9.Signal=GPIO_Output
Mcu.Package=LQFP64
VP_RCC_VS_USB.Mode=USB_FS
PA14.Locked=true
ProjectManager.ToolChainLocation=
RCC.LSI_VALUE=32000
VP_SYS_VS_Systick.Signal=SYS_VS_Systick
HRTIM1.OCPolarity_TE1=HRTIM_OUTPUTPOLARITY_HIGH
RCC.LSCOPinFreq_Value=32000
RTC.WakeUpCounter-WakeUp=1
VP_RTC_VS_RTC_Calendar.Mode=RTC_Calendar
PA15.Signal=FDCAN3_TX
HRTIM1.ADCTrigger1_Source1=HRTIM_ADCTRIGGEREVENT13_TIMERF_RESET
NVIC.USB_LP_IRQn=true\:0\:0\:false\:false\:true\:true\:true
HRTIM1.NumberADCTriggerSource2=1
HRTIM1.NumberADCTriggerSource1=1
PB9.GPIO_Speed=GPIO_SPEED_FREQ_VERY_HIGH
RCC.PLLPoutputFreq_Value=56666666.666666664
RCC.APB1TimFreq_Value=170000000
NVIC.BusFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false
HRTIM1.OCMode_TD1=HRTIM_BASICOCMODE_ACTIVE
RCC.LPUART1Freq_Value=170000000
RCC.CK48CLockSelection=RCC_USBCLKSOURCE_HSI48
PF1-OSC_OUT.Mode=HSE-External-Oscillator
HRTIM1.UpDownMode-Output_TE1TE2=HRTIM_TIMERUPDOWNMODE_UPDOWN
HRTIM1.OCPolarity_TF1=HRTIM_OUTPUTPOLARITY_HIGH
ProjectManager.CustomerFirmwarePackage=
PC14-OSC32_IN.Locked=true
PF1-OSC_OUT.Signal=RCC_OSC_OUT
RCC.HSI48_VALUE=48000000
PB15.Locked=true
RCC.HRTIM1Freq_Value=170000000
VP_RTC_VS_RTC_Activate.Signal=RTC_VS_RTC_Activate
HRTIM1.ADCTrigger_Id7=__NULL
RCC.PLLSourceVirtual=RCC_PLLSOURCE_HSE
PC15-OSC32_OUT.Mode=LSE-External-Oscillator
RCC.I2SFreq_Value=170000000
RCC.PLLQoutputFreq_Value=42500000
ProjectManager.ProjectFileName=combiner_g474.ioc
PB9.GPIO_Label=gpio_usb
Mcu.PinsNb=25
ProjectManager.NoMain=false
HRTIM1.UpDownMode-Output_TD1TD2=HRTIM_TIMERUPDOWNMODE_UPDOWN
HRTIM1.ADCTrigger2_Source1=HRTIM_ADCTRIGGEREVENT24_TIMERF_PERIOD
PC8.Signal=HRTIM1_CHE1
PC6.Signal=HRTIM1_CHF1
RCC.EXTERNAL_CLOCK_VALUE=12288000
ProjectManager.DefaultFWLocation=true
ProjectManager.DeletePrevious=true
PF1-OSC_OUT.Locked=true
PB14.Locked=true
PC14-OSC32_IN.Signal=RCC_OSC32_IN
RCC.QSPIFreq_Value=170000000
boardIOC=true
RCC.FamilyName=M
HRTIM1.PrescalerRatio_TF=HRTIM_PRESCALERRATIO_MUL32
PB9.GPIOParameters=GPIO_Speed,GPIO_Label
PC12.GPIOParameters=GPIO_Speed,PinState,GPIO_Label
PA13.Signal=SYS_JTMS-SWDIO
PC15-OSC32_OUT.Locked=true
PC12.PinState=GPIO_PIN_RESET
ProjectManager.TargetToolchain=Makefile
PC6.Mode=Output_TF1TF2
VP_RTC_VS_RTC_WakeUp_intern.Signal=RTC_VS_RTC_WakeUp_intern
PB9.Locked=true
RCC.USBFreq_Value=48000000
PC15-OSC32_OUT.Signal=RCC_OSC32_OUT
HRTIM1.Adrom_TF=HRTIM_TIM_ADROM_VALLEY
PF0-OSC_IN.Mode=HSE-External-Oscillator
PB14.Signal=HRTIM1_CHD1
HRTIM1.ADCTrigger_Id2=__NULL
HRTIM1.ADCTrigger_Id1=HRTIM_ADCTRIGGER_1
HRTIM1.ADCTrigger_Id3=__NULL
HRTIM1.ADCTrigger_Id6=__NULL
board=NUCLEO-G474RE
HRTIM1.ADCTrigger_Id5=HRTIM_ADCTRIGGER_5
NVIC.HRTIM1_Master_IRQn=true\:0\:0\:false\:false\:true\:false\:true
RCC.VCOOutputFreq_Value=340000000
ProjectManager.LastFirmware=true
PB15.Mode=Output_TD1TD2
RCC.ADC345Freq_Value=56666666.666666664
RCC.APB2Freq_Value=170000000
RCC.UART4Freq_Value=170000000
MxCube.Version=5.6.0
RCC.I2C1Freq_Value=170000000
VP_SYS_VS_DBSignals.Signal=SYS_VS_DBSignals
RCC.FDCANFreq_Value=170000000
HRTIM1.OCChannel_TE1=HRTIM_OUTPUT_TE1
RCC.RNGFreq_Value=48000000
VP_SYS_VS_Systick.Mode=SysTick
HRTIM1.PWMChannel_TF2=__NULL
HRTIM1.PWMChannel_TF1=__NULL
NVIC.NonMaskableInt_IRQn=true\:0\:0\:false\:false\:true\:false\:false
HRTIM1.postscaler5=0
RCC.UART5Freq_Value=170000000
ProjectManager.FreePins=false
RCC.IPParameters=ADC12CLockSelection,ADC12Freq_Value,ADC345CLockSelection,ADC345Freq_Value,AHBFreq_Value,APB1Freq_Value,APB1TimFreq_Value,APB2Freq_Value,APB2TimFreq_Value,CK48CLockSelection,CRSFreq_Value,CortexFreq_Value,EXTERNAL_CLOCK_VALUE,FCLKCortexFreq_Value,FDCANFreq_Value,FamilyName,HCLKFreq_Value,HRTIM1Freq_Value,HSE_VALUE,HSI48_VALUE,HSI_VALUE,I2C1Freq_Value,I2C2Freq_Value,I2C3Freq_Value,I2C4Freq_Value,I2SFreq_Value,LPTIM1Freq_Value,LPUART1Freq_Value,LSCOPinFreq_Value,LSI_VALUE,MCO1PinFreq_Value,PLLM,PLLN,PLLP,PLLPoutputFreq_Value,PLLQ,PLLQoutputFreq_Value,PLLRCLKFreq_Value,PLLSourceVirtual,PREFETCH_ENABLE,PWRFreq_Value,QSPIFreq_Value,RNGFreq_Value,RTCClockSelection,RTCFreq_Value,SAI1Freq_Value,SYSCLKFreq_VALUE,SYSCLKSource,UART4Freq_Value,UART5Freq_Value,USART1Freq_Value,USART2Freq_Value,USART3Freq_Value,USBFreq_Value,VCOInputFreq_Value,VCOOutputFreq_Value
ProjectManager.AskForMigrate=true
Mcu.Name=STM32G474R(B-C-E)Tx
Mcu.Pin24=VP_SYS_VS_DBSignals
PA13.GPIO_Label=T_SWDIO
ProjectManager.UnderRoot=false
HRTIM1.OCChannel_TF1=HRTIM_OUTPUT_TF1
Mcu.IP6=USB
PC8.Mode=Output_TE1TE2
HRTIM1.OCChannel_TF2=__NULL
ProjectManager.CoupleFile=false
RCC.SYSCLKFreq_VALUE=170000000
Mcu.Pin22=VP_RTC_VS_RTC_WakeUp_intern
Mcu.Pin23=VP_SYS_VS_Systick
Mcu.Pin20=VP_RTC_VS_RTC_Activate
Mcu.Pin21=VP_RTC_VS_RTC_Calendar
PA12.Mode=Device
NVIC.ForceEnableDMAVector=true
KeepUserPlacement=true
PA14.GPIOParameters=GPIO_Label
RCC.ADC12CLockSelection=RCC_ADC12CLKSOURCE_PLL
NVIC.MemoryManagement_IRQn=true\:0\:0\:false\:false\:true\:false\:false
PA13.Locked=true
PC12.GPIO_Label=gpio_fl
ProjectManager.CompilerOptimize=6
PA11.Signal=USB_DM
PA14.Signal=SYS_JTCK-SWCLK
ProjectManager.HeapSize=0x2000
Mcu.Pin15=PA15
NVIC.HardFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false
Mcu.Pin16=PC12
Mcu.Pin13=PA13
Mcu.Pin14=PA14
Mcu.Pin19=VP_RCC_VS_USB
ProjectManager.ComputerToolchain=false
Mcu.Pin17=PD2
RCC.HSI_VALUE=16000000
Mcu.Pin18=PB9
VP_RTC_VS_RTC_WakeUp_intern.Mode=WakeUp
RCC.PLLP=RCC_PLLP_DIV6
RCC.PLLQ=RCC_PLLQ_DIV8
NVIC.PriorityGroup=NVIC_PRIORITYGROUP_4
Mcu.Pin11=PA11
Mcu.Pin12=PA12
HRTIM1.OCPulse_TE1=hrperiod/2
RCC.PLLM=RCC_PLLM_DIV6
RCC.PLLN=85
Mcu.Pin10=PA8
RCC.PWRFreq_Value=170000000
PA8.Mode=FDCANFD
VP_RCC_VS_USB.Signal=RCC_VS_USB
PC9.Signal=HRTIM1_CHE2
HRTIM1.Configuration_TF=Simple
PF0-OSC_IN.Signal=RCC_OSC_IN
HRTIM1.Configuration_TD=Simple
PC7.Mode=Output_TF1TF2
HRTIM1.Configuration_TE=Simple
PD2.Signal=GPIO_Output
RCC.I2C2Freq_Value=170000000
RCC.APB1Freq_Value=170000000
PC12.GPIO_Speed=GPIO_SPEED_FREQ_VERY_HIGH
HRTIM1.OCChannel_TD1=HRTIM_OUTPUT_TD1
ProjectManager.DeviceId=STM32G474RETx
HRTIM1.Periode_TD=hrperiod
PD2.GPIO_Label=gpio_ml
HRTIM1.Periode_TE=hrperiod
ProjectManager.LibraryCopy=1
HRTIM1.Periode_TF=hrperiod
HRTIM1.OCPulse_TF1=hrperiod/2
HRTIM1.OCPulse_TF2=4000
HRTIM1.IPParameters=ADCTrigger_Id1,ADCTrigger_Id2,UpDownMode-Output_TF1TF2,Configuration_TF,EnableCalibration,PWMChannel_TF1,PWMChannel_TF2,Periode_TF,PrescalerRatio_TF,ADCTrigger_Id3,NumberADCTriggerSource1,ADCTrigger1_Source1,NumberADCTriggerSource2,ADCTrigger2_Source1,ADCTrigger_Id6,OCChannel_TF1,ADCTrigger_Id7,OCMode_TF1,OCPulse_TF1,OCChannel_TF2,OCMode_TF2,OCPulse_TF2,Configuration_TE,Periode_TE,UpDownMode-Output_TE1TE2,OCChannel_TE1,OCMode_TE1,OCPulse_TE1,ADCTrigger_Id5,Source_ADCTrigger5,ORingUpdateSource_ADCTrigger5,postscaler5,Configuration_TD,Periode_TD,UpDownMode-Output_TD1TD2,OCChannel_TD1,OCMode_TD1,OCPulse_TD1,OCPolarity_TD1,OCPolarity_TE1,OCPolarity_TF1,Adrom_TF,ORingUpdateSource_ADCTrigger1
